CSI API ETABS v1
cPropMaterial.SetMassSource_1 Method
 Sets the mass source for the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMassSource_1(
	ref bool IncludeElements,
	ref bool IncludeAddedMass,
	ref bool IncludeLoads,
	int NumberLoads,
	ref string[] LoadPat,
	ref double[] sf
)
Function SetMassSource_1 (
	ByRef IncludeElements As Boolean,
	ByRef IncludeAddedMass As Boolean,
	ByRef IncludeLoads As Boolean,
	NumberLoads As Integer,
	ByRef LoadPat As String(),
	ByRef sf As Double()
) As Integer
Dim instance As cPropMaterial
Dim IncludeElements As Boolean
Dim IncludeAddedMass As Boolean
Dim IncludeLoads As Boolean
Dim NumberLoads As Integer
Dim LoadPat As String()
Dim sf As Double()
Dim returnValue As Integer
returnValue = instance.SetMassSource_1(IncludeElements,
	IncludeAddedMass, IncludeLoads,
	NumberLoads, LoadPat, sf)
int SetMassSource_1(
	bool% IncludeElements,
	bool% IncludeAddedMass,
	bool% IncludeLoads,
	int NumberLoads,
	array<String^>^% LoadPat,
	array<double>^% sf
)
abstract SetMassSource_1 :
        IncludeElements : bool byref *
        IncludeAddedMass : bool byref *
        IncludeLoads : bool byref *
        NumberLoads : int *
        LoadPat : string[] byref *
        sf : float[] byref -> int
Parameters
IncludeElements
Type: System.Boolean
 Include element self mass
IncludeAddedMass
Type: System.Boolean
 Include additional masses
IncludeLoads
Type: System.Boolean
 Include specified loads
NumberLoads
Type: System.Int32
The number of load patterns from which mass is obtained. This item applies only when IncludeLoads is True.
LoadPat
Type: System.String[]
This is an array of the names of the load patterns from which mass is obtained. This item applies only when IncludeLoads is True.
sf
Type: System.Double[]
This is an array of load patterns multipliers used to calculate the mass. This item applies only when IncludeLoads is True.
Return Value
Type: Int32
Returns zero if the mass source is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyLoadPat() As String
       Dim MySF() As Double
       Dim MyOption As Integer
       Dim NumberLoads As Integer
       Dim LoadPat() As String
       Dim sf() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set mass source
       ReDim MyLoadPat(1)
       ReDim MySF(1)
       MyLoadPat(0) = "DEAD"
       MyLoadPat(1) = "LIVE"
       MySF(0) = 1
       MySF(1) = 0.2
       ret = SapModel.PropMaterial.SetMassSource(3, 2, MyLoadPat, MySF)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace